tangyangguang/Esp32Base/src/web/internal/WebRouting.cpp
bool loadStoredAuth() {
    char user[32];
    char pass[64];
    Preferences prefs;
    if (!prefs.begin("eb_web", true)) {
        return false;
    }
    const bool readOk = readStoredAuth(prefs, user, sizeof(user), pass, sizeof(pass));
    prefs.end();
    if (!readOk) {
        return false;
    }
    if (!validAuthUser(user) || !validAuthPass(pass)) {
        ESP32BASE_LOG_W("web", "auth_load_failed reason=invalid_storage");
        return false;
    }
    applyStoredAuth(user, pass);
    ESP32BASE_LOG_I("web", "auth_loaded user=%s password_set=%s source=stored",
                    g_authUser,
                    g_authPass[0] ? "yes" : "no");
    return true;
}

bool storedAuthMatches(const char* storedUser, const char* storedPass, const char* user, const char* pass) {
    return storedUser && storedPass && user && pass &&
           strcmp(storedUser, user) == 0 && strcmp(storedPass, pass) == 0;
}

bool writeAuthKeyIfChanged(Preferences& prefs, const char* key, const char* stored, const char* value) {
    if (stored && value && strcmp(stored, value) == 0) {
        return true;
    }
    return value && prefs.putString(key, value) > 0;
}

bool saveStoredAuth(const char* user, const char* pass) {
    Preferences prefs;
    if (!prefs.begin("eb_web", false)) {
        return false;
    }

    char storedUser[32];
    char storedPass[64];
    const bool hasStored = readStoredAuth(prefs, storedUser, sizeof(storedUser), storedPass, sizeof(storedPass));
    if (hasStored && storedAuthMatches(storedUser, storedPass, user, pass)) {
        prefs.end();
        return true;
    }
    bool ok = writeAuthKeyIfChanged(prefs, "auth_pass", hasStored ? storedPass : nullptr, pass) &&
              writeAuthKeyIfChanged(prefs, "auth_user", hasStored ? storedUser : nullptr, user);
    if (ok) {
        char verifyUser[32];
        char verifyPass[64];
        ok = readStoredAuth(prefs, verifyUser, sizeof(verifyUser), verifyPass, sizeof(verifyPass)) &&
             strcmp(verifyUser, user) == 0 &&
             strcmp(verifyPass, pass) == 0;
    }
    prefs.end();
    return ok;
}

bool validFooterBarMode(Esp32BaseWeb::FooterBarMode mode) {
    return mode == Esp32BaseWeb::FOOTER_BAR_OFF ||
           mode == Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY ||
           mode == Esp32BaseWeb::FOOTER_BAR_FULL;
}

const char* footerBarModeName(Esp32BaseWeb::FooterBarMode mode) {
    switch (mode) {
        case Esp32BaseWeb::FOOTER_BAR_OFF: return "Off";
        case Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY: return "Status only";
        case Esp32BaseWeb::FOOTER_BAR_FULL: return "Links + status";
        default: return "Unknown";
    }
}

Esp32BaseWeb::FooterBarMode readFooterBarMode() {
    const int32_t raw = Esp32BaseConfig::getInt("eb_ui", "footer_mode", Esp32BaseWeb::FOOTER_BAR_FULL);
    const Esp32BaseWeb::FooterBarMode mode = static_cast<Esp32BaseWeb::FooterBarMode>(raw);
    return validFooterBarMode(mode) ? mode : Esp32BaseWeb::FOOTER_BAR_FULL;
}

bool validHeaderValue(const char* value, size_t maxLen) {
    if (!value || !value[0]) {
        return false;
    }
    const size_t len = strlen(value);
    if (len > maxLen) {
        return false;
    }
    for (const char* p = value; *p; ++p) {
        const uint8_t c = static_cast<uint8_t>(*p);
        if (c < 0x20 || c == 0x7f) {
            return false;
        }
    }
    return true;
}

bool validHeaderName(const char* name, size_t maxLen) {
    if (!name || !name[0]) {
        return false;
    }
    size_t len = 0;
    for (const char* p = name; *p; ++p) {
        const char c = *p;
        const bool ok = (c >= 'A' && c <= 'Z') ||
                        (c >= 'a' && c <= 'z') ||
                        (c >= '0' && c <= '9') ||
                        c == '-';
        if (!ok) {
            return false;
        }
        ++len;
        if (len > maxLen) {
            return false;
        }
    }
    return true;
}

bool sameHost(const char* a, const char* b) {
    if (!a || !b || !a[0] || !b[0]) {
        return false;
    }
    while (*a && *b) {
        char ca = *a++;
        char cb = *b++;
        if (ca >= 'A' && ca <= 'Z') {
            ca = static_cast<char>(ca - 'A' + 'a');
        }
        if (cb >= 'A' && cb <= 'Z') {
            cb = static_cast<char>(cb - 'A' + 'a');
        }
        if (ca != cb) {
            return false;
        }
    }
    return *a == '\0' && *b == '\0';
}

bool extractUrlHost(const char* url, char* out, size_t len) {
    if (!url || !out || len == 0) {
        return false;
    }
    out[0] = '\0';
    const char* p = nullptr;
    if (strncmp(url, "http://", 7) == 0) {
        p = url + 7;
    } else if (strncmp(url, "https://", 8) == 0) {
        p = url + 8;
    } else {
        return false;
    }
    const char* end = p;
    while (*end && *end != '/' && *end != '?' && *end != '#') {
        ++end;
    }
    const char* at = static_cast<const char*>(memchr(p, '@', static_cast<size_t>(end - p)));
    if (at) {
        p = at + 1;
    }
    const size_t hostLen = static_cast<size_t>(end - p);
    if (hostLen == 0 || hostLen >= len) {
        return false;
    }
    memcpy(out, p, hostLen);
    out[hostLen] = '\0';
    return true;
}

bool requestSameOrigin() {
    const String origin = g_server.header("Origin");
    const String referer = g_server.header("Referer");
    if (origin.length() == 0 && referer.length() == 0) {
        return true;
    }

    const String hostHeader = g_server.header("Host");
    char host[96];
    strlcpy(host, hostHeader.c_str(), sizeof(host));
    if (!host[0]) {
        return false;
    }

    char sourceHost[96];
    if (origin.length() > 0) {
        if (!extractUrlHost(origin.c_str(), sourceHost, sizeof(sourceHost))) {
            return false;
        }
        return sameHost(host, sourceHost);
    }
    if (!extractUrlHost(referer.c_str(), sourceHost, sizeof(sourceHost))) {
        return false;
    }
    return sameHost(host, sourceHost);
}

bool ensurePostAllowed(const char* context) {
    if (!g_requestContextActive) {
        markRequest();
    }
    if (g_currentMethod != Esp32BaseWeb::METHOD_POST) {
        ESP32BASE_LOG_W("web",
                        "post_rejected context=%s reason=method method=%s",
                        context ? context : "unknown",
                        methodName(g_currentMethod));
        g_server.send(405, "text/plain", "Method Not Allowed");
        return false;
    }
    if (!ensureAuth()) {
        return false;
    }
    if (requestSameOrigin()) {
        return true;
    }
    ESP32BASE_LOG_W("web", "post_rejected context=%s reason=cross_origin", context ? context : "unknown");
    g_server.send(403, "text/plain", "Forbidden");
    return false;
}

bool validDownloadFilename(const char* filename) {
    if (!filename || !filename[0] || strlen(filename) > 63) {
        return false;
    }
    for (const char* p = filename; *p; ++p) {
        const char c = *p;
        const bool ok = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
                        (c >= '0' && c <= '9') || c == '.' || c == '_' || c == '-';
        if (!ok) {
            return false;
        }
    }
    return true;
}

bool appendQuotedHeaderValue(char* out, size_t len, const char* value) {
    if (!out || len == 0 || !value) {
        return false;
    }
    size_t used = strlen(out);
    for (const char* p = value; *p; ++p) {
        const char c = *p;
        if (c == '"' || c == '\\') {
            if (used + 2 >= len) {
                return false;
            }
            out[used++] = '\\';
            out[used++] = c;
        } else {
            if (used + 1 >= len) {
                return false;
            }
            out[used++] = c;
        }
    }
    out[used] = '\0';
    return true;
}

