tangyangguang/Esp32Base/src/web/internal/WebRouting.cpp
uint8_t appPageCount() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && g_routes[i].appPage) {
            ++count;
        }
    }
    return count;
}

uint8_t navItemCount() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (g_navItems[i].path[0]) {
            ++count;
        }
    }
    return count;
}

bool navPathExists(const char* path) {
    if (!path || !path[0]) {
        return false;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (g_navItems[i].path[0] && strcmp(g_navItems[i].path, path) == 0) {
            return true;
        }
    }
    return false;
}

uint8_t appNavCount() {
    uint8_t count = navItemCount();
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && g_routes[i].appPage && !navPathExists(g_routes[i].path)) {
            ++count;
        }
    }
    return count;
}

const char* configuredHomePath() {
    if (g_homePath[0]) {
        return g_homePath;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (strcmp(g_navItems[i].path, "/index") == 0) {
            return g_navItems[i].path;
        }
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && g_routes[i].appPage && strcmp(g_routes[i].path, "/index") == 0) {
            return g_routes[i].path;
        }
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (g_navItems[i].path[0]) {
            return g_navItems[i].path;
        }
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && g_routes[i].appPage) {
            return g_routes[i].path;
        }
    }
    return "/esp32base/status";
}

bool isBuiltinWebPath(const char* path) {
    static const char prefix[] = "/esp32base";
    if (!path || !path[0]) {
        return false;
    }
    const size_t len = sizeof(prefix) - 1;
    return strncmp(path, prefix, len) == 0 && (path[len] == '\0' || path[len] == '/');
}

bool shouldSendHeadExtra() {
    return g_headExtraCallback && !isBuiltinWebPath(g_activeUri);
}

bool navPathMatches(const char* navPath, const char* currentPath) {
    if (!navPath || !navPath[0] || !currentPath || !currentPath[0]) {
        return false;
    }
    const size_t navLen = strlen(navPath);
    if (strncmp(currentPath, navPath, navLen) != 0) {
        return false;
    }
    if (currentPath[navLen] == '\0') {
        return true;
    }
    return navLen > 1 && currentPath[navLen] == '/';
}

void updateActivePath(const char* candidate, const char* currentPath, const char*& activePath, size_t& activeLen) {
    if (!navPathMatches(candidate, currentPath)) {
        return;
    }
    const size_t len = strlen(candidate);
    if (len > activeLen) {
        activePath = candidate;
        activeLen = len;
    }
}

const char* activeNavPath(bool includeSystemLinks) {
    const char* activePath = nullptr;
    size_t activeLen = 0;
    const char* currentPath = g_activeUri[0] ? g_activeUri : "/";
    updateActivePath(configuredHomePath(), currentPath, activePath, activeLen);
    if (g_homeMode != Esp32BaseWeb::HOME_ESP32BASE) {
        for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
            if (g_navItems[i].path[0]) {
                updateActivePath(g_navItems[i].path, currentPath, activePath, activeLen);
            }
        }
        for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
            if (g_routes[i].handler && g_routes[i].appPage && !navPathExists(g_routes[i].path)) {
                updateActivePath(g_routes[i].path, currentPath, activePath, activeLen);
            }
        }
    }
    if (includeSystemLinks) {
        updateActivePath("/esp32base/status", currentPath, activePath, activeLen);
        if (navPathMatches("/esp32base/wifi", currentPath) ||
            navPathMatches("/esp32base/auth", currentPath)
#if ESP32BASE_ENABLE_FS
            || navPathMatches("/esp32base/fs", currentPath)
#endif
#if ESP32BASE_ENABLE_OTA
            || navPathMatches("/esp32base/ota", currentPath)
#endif
        ) {
            activePath = "/esp32base/system";
            activeLen = strlen(activePath);
        }
        updateActivePath("/esp32base/logs", currentPath, activePath, activeLen);
#if ESP32BASE_ENABLE_APP_CONFIG
        updateActivePath("/esp32base/app-config", currentPath, activePath, activeLen);
#endif
        updateActivePath("/esp32base/system", currentPath, activePath, activeLen);
    }
    return activePath;
}


bool ensureAuth() {
    if (!g_activeUri[0]) {
        markRequest();
    }
    if (!g_authEnabled) {
        return true;
    }
    if (parseAndCheckAuth("check")) {
        return true;
    }
    g_server.requestAuthentication();
    return false;
}

bool isAuthenticated() {
    if (!g_authEnabled) {
        return true;
    }
    return parseAndCheckAuth("verify");
}

void dispatchRoute(Route& route) {
    g_requestContextActive = true;
    markRequest();
    if (route.handler) {
        route.handler();
    }
    g_responseActive = false;
    g_requestContextActive = false;
    g_currentMethod = Esp32BaseWeb::METHOD_UNKNOWN;
}

void registerRoute(Route& route) {
    if (strcmp(route.path, "/") == 0 && routeMatchesMethod(route, Esp32BaseWeb::METHOD_GET)) {
        route.registered = true;
        return;
    }
    Route* routePtr = &route;
    g_server.on(route.path, toHttpMethod(route.method), [routePtr]() {
        dispatchRoute(*routePtr);
    });
    route.registered = true;
}

void dispatchStaticAsset(StaticAsset& asset) {
    g_requestContextActive = true;
    markRequest();
    if (asset.authRequired && !ensureAuth()) {
        g_requestContextActive = false;
        g_currentMethod = Esp32BaseWeb::METHOD_UNKNOWN;
        return;
    }
    if (!asset.data || asset.len == 0 || !asset.contentType || !asset.contentType[0]) {
        g_server.send(404, "text/plain", "Not found");
        g_requestContextActive = false;
        g_currentMethod = Esp32BaseWeb::METHOD_UNKNOWN;
        return;
    }
    char cacheControl[40];
    if (asset.cacheMaxAgeSec > 0) {
        snprintf(cacheControl, sizeof(cacheControl), "%s, max-age=%lu",
                 asset.authRequired ? "private" : "public",
                 static_cast<unsigned long>(asset.cacheMaxAgeSec));
    } else {
        strlcpy(cacheControl, "no-store", sizeof(cacheControl));
    }
    g_server.sendHeader("Cache-Control", cacheControl);
    g_server.sendHeader("X-Content-Type-Options", "nosniff");
    g_server.setContentLength(asset.len);
    g_server.send(200, asset.contentType, "");
    WiFiClient client = g_server.client();
    writeClientBytes(client, reinterpret_cast<const char*>(asset.data), asset.len);
    g_requestContextActive = false;
    g_currentMethod = Esp32BaseWeb::METHOD_UNKNOWN;
}

void registerStaticAsset(StaticAsset& asset) {
    if (!asset.path[0]) {
        return;
    }
    StaticAsset* assetPtr = &asset;
    g_server.on(asset.path, HTTP_GET, [assetPtr]() {
        dispatchStaticAsset(*assetPtr);
    });
    asset.registered = true;
}

void handleCaptiveProbe() {
    g_server.sendHeader("Location", "/esp32base/wifi", true);
    g_server.send(302, "text/plain", "");
}

void handleRootRedirect() {
    markRequest();
    const char* location = g_homeMode == Esp32BaseWeb::HOME_ESP32BASE ? "/esp32base/status" : configuredHomePath();
    if (g_homeMode != Esp32BaseWeb::HOME_ESP32BASE && strcmp(configuredHomePath(), "/") == 0) {
        Route* route = findRoute("/", Esp32BaseWeb::METHOD_GET);
        if (route && route->handler) {
            dispatchRoute(*route);
            return;
        }
        location = "/esp32base/status";
    }
    g_server.sendHeader("Location", location, true);
    g_server.send(302, "text/plain", "");
}

void appendUrlEncoded(String& output, const String& value) {
    static const char hex[] = "0123456789ABCDEF";
    for (size_t i = 0; i < value.length(); ++i) {
        const uint8_t c = static_cast<uint8_t>(value[i]);
        const bool unreserved = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
                                (c >= '0' && c <= '9') || c == '-' || c == '.' ||
                                c == '_' || c == '~';
        if (unreserved) {
            output += static_cast<char>(c);
        } else {
            output += '%';
            output += hex[(c >> 4) & 0x0F];
            output += hex[c & 0x0F];
        }
    }
}

void handleStatusRedirect() {
    markRequest();
    String location = "/esp32base/status";
    for (int i = 0; i < g_server.args(); ++i) {
        location += i == 0 ? '?' : '&';
        appendUrlEncoded(location, g_server.argName(i));
        location += '=';
        appendUrlEncoded(location, g_server.arg(i));
    }
    g_server.sendHeader("Location", location, true);
    g_server.sendHeader("Cache-Control", "no-store");
    g_server.send(302, "text/plain", "");
}

void handleNoContent() {
    g_server.send(204, "text/plain", "");
}

void handleNotFound() {
    markRequest();
    const String uri = g_server.uri();
    if (uri.length() > 1 && uri.endsWith("/")) {
        String normalized = uri;
        while (normalized.length() > 1 && normalized.endsWith("/")) {
            normalized.remove(normalized.length() - 1);
        }
        g_server.sendHeader("Location", normalized, true);
        g_server.sendHeader("Cache-Control", "no-store");
        g_server.send(g_server.method() == HTTP_GET ? 302 : 307, "text/plain", "");
        return;
    }
    g_server.send(404, "text/plain", "Not found");
}

} // namespace esp32base_web

#endif
